cmsis-svd/cmsis-svd/data/Spansion/MB9BF51xN_svd.xml
        <!-- REGISTER "PFR6" -->
        <register>
          <name>PFR6</name>
          <description>Port function setting register 6</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P63" -->
            <field>
              <name>P63</name>
              <description>Bit3 of PFR6</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P62" -->
            <field>
              <name>P62</name>
              <description>Bit2 of PFR6</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P61" -->
            <field>
              <name>P61</name>
              <description>Bit1 of PFR6</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P60" -->
            <field>
              <name>P60</name>
              <description>Bit0 of PFR6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR8" -->
        <register>
          <name>PFR8</name>
          <description>Port function setting register 8</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P81" -->
            <field>
              <name>P81</name>
              <description>Bit1 of PFR8</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P80" -->
            <field>
              <name>P80</name>
              <description>Bit0 of PFR8</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFRE" -->
        <register>
          <name>PFRE</name>
          <description>Port function setting register E</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000000B</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PE3" -->
            <field>
              <name>PE3</name>
              <description>Bit3 of PFRE</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE2" -->
            <field>
              <name>PE2</name>
              <description>Bit2 of PFRE</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE0" -->
            <field>
              <name>PE0</name>
              <description>Bit0 of PFRE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PCR0" -->
        <register derivedFrom="PFR0">
          <name>PCR0</name>
          <description>Pull-up Setting Register 0</description>
          <addressOffset>0x100</addressOffset>
        </register>
        <!-- REGISTER "PCR1" -->
        <register derivedFrom="PFR1">
          <name>PCR1</name>
          <description>Pull-up Setting Register 1</description>
          <addressOffset>0x104</addressOffset>
        </register>
        <!-- REGISTER "PCR2" -->
        <register derivedFrom="PFR2">
          <name>PCR2</name>
          <description>Pull-up Setting Register 2</description>
          <addressOffset>0x108</addressOffset>
        </register>
        <!-- REGISTER "PCR3" -->
        <register derivedFrom="PFR3">
          <name>PCR3</name>
          <description>Pull-up Setting Register 3</description>
          <addressOffset>0x10C</addressOffset>
        </register>
        <!-- REGISTER "PCR4" -->
        <register derivedFrom="PFR4">
          <name>PCR4</name>
          <description>Pull-up Setting Register 4</description>
          <addressOffset>0x110</addressOffset>
        </register>
        <!-- REGISTER "PCR5" -->
        <register derivedFrom="PFR5">
          <name>PCR5</name>
          <description>Pull-up Setting Register 5</description>
          <addressOffset>0x114</addressOffset>
        </register>
        <!-- REGISTER "PCR6" -->
        <register derivedFrom="PFR6">
          <name>PCR6</name>
          <description>Pull-up Setting Register 6</description>
          <addressOffset>0x118</addressOffset>
        </register>
        <!-- REGISTER "PCR8" -->
        <register derivedFrom="PFR8">
          <name>PCR8</name>
          <description>Pull-up Setting Register 8</description>
          <addressOffset>0x120</addressOffset>
        </register>
        <!-- REGISTER "PCRE" -->
        <register derivedFrom="PFRE">
          <name>PCRE</name>
          <description>Pull-up Setting Register E</description>
          <addressOffset>0x138</addressOffset>
        </register>
        <!-- REGISTER "DDR0" -->
        <register>
          <name>DDR0</name>
          <description>Port input/output direction setting register 0</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P0F" -->
            <field>
              <name>P0F</name>
              <description>Bit15 of DDR0</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0E" -->
            <field>
              <name>P0E</name>
              <description>Bit14 of DDR0</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0D" -->
            <field>
              <name>P0D</name>
              <description>Bit13 of DDR0</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0C" -->
            <field>
              <name>P0C</name>
              <description>Bit12 of DDR0</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0B" -->
            <field>
              <name>P0B</name>
              <description>Bit11 of DDR0</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0A" -->
            <field>
              <name>P0A</name>
              <description>Bit10 of DDR0</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P09" -->
            <field>
              <name>P09</name>
              <description>Bit9 of DDR0</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P08" -->
            <field>
              <name>P08</name>
              <description>Bit8 of DDR0</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P07" -->
            <field>
              <name>P07</name>
              <description>Bit7 of DDR0</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P06" -->
            <field>
              <name>P06</name>
              <description>Bit6 of DDR0</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P05" -->
            <field>
              <name>P05</name>
              <description>Bit5 of DDR0</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P04" -->
            <field>
              <name>P04</name>
              <description>Bit4 of DDR0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P03" -->
            <field>
              <name>P03</name>
              <description>Bit3 of DDR0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P02" -->
            <field>
              <name>P02</name>
              <description>Bit2 of DDR0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P01" -->
            <field>
              <name>P01</name>
              <description>Bit1 of DDR0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P00" -->
            <field>
              <name>P00</name>
              <description>Bit0 of DDR0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDR1" -->
        <register derivedFrom="PFR1">
          <name>DDR1</name>
          <description>Port input/output direction setting register 1</description>
          <addressOffset>0x204</addressOffset>
        </register>
        <!-- REGISTER "DDR2" -->
        <register derivedFrom="PFR2">
          <name>DDR2</name>
          <description>Port input/output direction setting register 2</description>
          <addressOffset>0x208</addressOffset>
        </register>
        <!-- REGISTER "DDR3" -->
        <register derivedFrom="PFR3">
          <name>DDR3</name>
          <description>Port input/output direction setting register 3</description>
          <addressOffset>0x20C</addressOffset>
        </register>
        <!-- REGISTER "DDR4" -->
        <register derivedFrom="PFR4">
          <name>DDR4</name>
          <description>Port input/output direction setting register 4</description>
          <addressOffset>0x210</addressOffset>
        </register>
        <!-- REGISTER "DDR5" -->
        <register derivedFrom="PFR5">
          <name>DDR5</name>
          <description>Port input/output direction setting register 5</description>
          <addressOffset>0x214</addressOffset>
        </register>
        <!-- REGISTER "DDR6" -->
        <register derivedFrom="PFR6">
          <name>DDR6</name>
          <description>Port input/output direction setting register 6</description>
          <addressOffset>0x218</addressOffset>
        </register>
        <!-- REGISTER "DDR8" -->
        <register derivedFrom="PFR8">
          <name>DDR8</name>
          <description>Port input/output direction setting register 8</description>
          <addressOffset>0x220</addressOffset>
        </register>
        <!-- REGISTER "DDRE" -->
        <register derivedFrom="PFRE">
          <name>DDRE</name>
          <description>Port input/output direction setting register E</description>
          <addressOffset>0x238</addressOffset>
        </register>
        <!-- REGISTER "PDIR0" -->
        <register derivedFrom="DDR0">
          <name>PDIR0</name>
          <description>Port input data register 0</description>
          <addressOffset>0x300</addressOffset>
        </register>
        <!-- REGISTER "PDIR1" -->
        <register derivedFrom="DDR1">
          <name>PDIR1</name>
          <description>Port input data register 1</description>
          <addressOffset>0x304</addressOffset>
        </register>
        <!-- REGISTER "PDIR2" -->
        <register derivedFrom="DDR2">
          <name>PDIR2</name>
          <description>Port input data register 2</description>
          <addressOffset>0x308</addressOffset>
        </register>
