cmsis-svd/cmsis-svd/data/Spansion/MB9BF51xN_svd.xml
        <!-- REGISTER "AREA5" -->
        <register>
          <name>AREA5</name>
          <description>Area Register 5</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0050</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA6" -->
        <register>
          <name>AREA6</name>
          <description>Area Register 6</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0060</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA7" -->
        <register>
          <name>AREA7</name>
          <description>Area Register 7</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0070</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ATIM0" -->
        <register>
          <name>ATIM0</name>
          <description>ALE Timing Register 0</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000045F</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ALEW" -->
            <field>
              <name>ALEW</name>
              <description>Address Latch Enable Width </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ALES" -->
            <field>
              <name>ALES</name>
              <description>Address Latch Enable Setup cycle</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ALC" -->
            <field>
              <name>ALC</name>
              <description>Address Latch Cycle</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ATIM1" -->
        <register derivedFrom="ATIM0">
          <name>ATIM1</name>
          <description>ALE Timing Register 1</description>
          <addressOffset>0x64</addressOffset>
        </register>
        <!-- REGISTER "ATIM2" -->
        <register derivedFrom="ATIM0">
          <name>ATIM2</name>
          <description>ALE Timing Register 2</description>
          <addressOffset>0x68</addressOffset>
        </register>
        <!-- REGISTER "ATIM3" -->
        <register derivedFrom="ATIM0">
          <name>ATIM3</name>
          <description>ALE Timing Register 3</description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "ATIM4" -->
        <register derivedFrom="ATIM0">
          <name>ATIM4</name>
          <description>ALE Timing Register 4</description>
          <addressOffset>0x70</addressOffset>
        </register>
        <!-- REGISTER "ATIM5" -->
        <register derivedFrom="ATIM0">
          <name>ATIM5</name>
          <description>ALE Timing Register 5</description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "ATIM6" -->
        <register derivedFrom="ATIM0">
          <name>ATIM6</name>
          <description>ALE Timing Register 6</description>
          <addressOffset>0x78</addressOffset>
        </register>
        <!-- REGISTER "ATIM7" -->
        <register derivedFrom="ATIM0">
          <name>ATIM7</name>
          <description>ALE Timing Register 7</description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "DCLKR" -->
        <register>
          <name>DCLKR</name>
          <description>Division Clock Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MCLKON" -->
            <field>
              <name>MCLKON</name>
              <description>MCLK ON</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDIV" -->
            <field>
              <name>MDIV</name>
              <description>MCLK Division Ratio Setup</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
